const percentColorsForProgress = [
    {
        pct: 0,
        color: { r: 0xff, g: 0x00, b: 0 }
    },
    {
        pct: 50,
        color: { r: 0xff, g: 0xff, b: 0 }
    },
    {
        pct: 100,
        color: { r: 0x00, g: 0x80, b: 0 }
    }
];

const percentColorsForText = [
    {
        pct: 0,
        color: { r: 0xff, g: 0x00, b: 0 }
    },
    {
        pct: 50,
        color: { r: 0xea, g: 0xcd, b: 0x76 }
    },
    {
        pct: 100,
        color: { r: 0x05, g: 0x77, b: 0x48 }
    }
];

export const getColor = function (pct: number, type: string = 'progress', begin: number = 0, end: number = 100) {
    let percentColors = [];
    if (type == 'progress') {
        percentColors = percentColorsForProgress;
    } else {
        percentColors = percentColorsForText;
    }
    percentColorsForProgress[0].pct = begin;
    percentColorsForProgress[1].pct = (begin + end) / 2;
    percentColorsForProgress[2].pct = end;
    percentColorsForText[0].pct = begin;
    percentColorsForText[1].pct = (begin + end) / 2;
    percentColorsForText[2].pct = end;
    let i = 1;
    for (; i < percentColors.length - 1; i++) {
        if (pct < percentColors[i].pct) {
            break;
        }
    }
    const lower = percentColors[i - 1];
    const upper = percentColors[i];
    const range = upper.pct - lower.pct;
    const rangePct = (pct - lower.pct) / range;
    const pctLower = 1 - rangePct;
    const pctUpper = rangePct;
    const color = {
        r: Math.floor(lower.color.r * pctLower + upper.color.r * pctUpper),
        g: Math.floor(lower.color.g * pctLower + upper.color.g * pctUpper),
        b: Math.floor(lower.color.b * pctLower + upper.color.b * pctUpper)
    };
    return `rgb(${[color.r, color.g, color.b].join(',')})`;
};

const clubsColor: { string: Array<number> } = {
    "AC米兰": [104, 73, 73],
    "PSV埃因霍温": [124, 98, 91],
    "上海上港": [195, 114, 89],
    "上海海港": [195, 114, 89],
    "上海申花": [181, 185, 207],
    "中日德兰": [157, 97, 100],
    "乌迪内斯": [192, 189, 177],
    "云达不来梅": [117, 147, 135],
    "亚历山德里亚": [203, 172, 165],
    "亚特兰大": [194, 203, 213],
    "亚眠": [184, 186, 186],
    "伯恩利": [144, 159, 121],
    "伯恩茅斯": [115, 92, 90],
    "伯明翰": [109, 122, 137],
    "佛罗伦萨": [230, 218, 215],
    "佛罗西诺内": [172, 179, 178],
    "佩鲁贾": [212, 122, 125],
    "克罗托内": [98, 90, 98],
    "克莱蒙": [65, 26, 53],
    "克雷默内塞": [217, 189, 180],
    "全北现代": [63, 102, 75],
    "兰斯": [232, 155, 156],
    "凯尔特人": [128, 173, 146],
    "切尔西": [154, 150, 181],
    "利兹联": [135, 138, 99],
    "利物浦": [138, 138, 134],
    "加的斯": [210, 211, 195],
    "勒沃库森": [159, 132, 111],
    "勒阿弗尔": [161, 172, 188],
    "北京国安": [74, 118, 37],
    "南安普顿": [192, 176, 169],
    "南特": [0, 50, 27],
    "南锡": [208, 154, 155],
    "博卡": [62, 71, 57],
    "博卡青年": [62, 71, 57],
    "博洛尼亚": [71, 56, 64],
    "卡利亚里": [154, 130, 140],
    "卡利美洲": [176, 139, 139],
    "卡塔赫纳": [205, 197, 185],
    "卡尔斯鲁厄": [129, 132, 173],
    "卡昂": [135, 123, 128],
    "卡迪夫城": [192, 201, 221],
    "卢戈": [189, 191, 198],
    "卢顿": [194, 198, 198],
    "哈德斯菲尔德": [114, 121, 126],
    "哥本哈根": [145, 147, 203],
    "因戈尔施塔特": [158, 140, 140],
    "国际米兰": [35, 125, 193],
    "图卢兹": [97, 71, 95],
    "圣保利": [226, 181, 178],
    "圣埃蒂安": [183, 222, 202],
    "埃因霍温": [124, 98, 91],
    "埃尔切": [224, 204, 185],
    "埃弗顿": [110, 153, 196],
    "埃瓦尔": [51, 52, 57],
    "基辅迪那摩": [208, 225, 236],
    "塞尔塔": [246, 232, 235],
    "塞维利亚": [228, 194, 184],
    "多特蒙德": [181, 172, 52],
    "奇塔代拉": [151, 127, 135],
    "奎维利鲁昂": [148, 145, 100],
    "奥厄": [108, 98, 74],
    "奥斯纳布": [131, 107, 145],
    "奥格斯堡": [160, 124, 103],
    "奥萨苏纳": [218, 202, 188],
    "女王公园巡游者": [198, 216, 234],
    "威尼斯": [116, 118, 114],
    "安特卫普": [131, 102, 106],
    "富勒姆": [122, 110, 111],
    "富恩拉夫拉达": [188, 182, 134],
    "尤文图斯": [69, 69, 69],
    "尼奥特": [157, 193, 216],
    "尼姆": [210, 157, 153],
    "尼斯": [176, 162, 152],
    "川崎前锋": [134, 144, 148],
    "巴列卡诺": [133, 114, 85],
    "巴塞罗那": [180, 149, 107],
    "巴拉多利德": [191, 189, 176],
    "巴斯蒂亚": [162, 164, 186],
    "巴黎FC": [136, 146, 162],
    "巴黎圣日尔曼": [51,134,172],
    "布伦特福德": [193, 126, 123],
    "布尔戈斯": [181, 182, 165],
    "布莱克本流浪者": [138, 161, 135],
    "布莱克浦": [227, 207, 187],
    "布莱顿": [154, 187, 219],
    "布里斯托尔城": [198, 174, 151],
    "布雷斯特": [222, 147, 151],
    "布雷西亚": [154, 159, 166],
    "布鲁日": [49, 54, 55],
    "希洪体育": [248, 220, 202],
    "帕尔马": [121, 124, 115],
    "帕德博恩": [49, 60, 69],
    "广州恒大": [105, 52, 26],
    "弗拉门戈": [97, 12, 12],
    "弗莱堡": [92, 92, 92],
    "彼得堡联": [160, 196, 223],
    "德比郡": [147, 147, 147],
    "德累斯顿迪纳摩": [85, 46, 29],
    "恩波利": [104, 131, 162],
    "慕尼黑1860": [120, 120, 120],
    "托特纳姆热刺": [88, 92, 100],
    "拉斯帕尔马斯": [57, 56, 36],
    "拉科鲁尼亚": [119, 104, 97],
    "拉齐奥": [160, 159, 152],
    "拜仁慕尼黑": [145, 104, 130],
    "摩纳哥": [244, 214, 195],
    "敦刻尔克": [90, 109, 120],
    "斯佩齐亚": [159, 155, 143],
    "斯图加特": [151, 102, 77],
    "斯帕尔": [98, 134, 147],
    "斯托克城": [178, 144, 162],
    "斯旺西": [200, 200, 200],
    "斯特拉斯堡": [100, 132, 156],
    "昂热": [181, 181, 178],
    "普雷斯顿": [171, 180, 192],
    "曼城": [179, 190, 199],
    "曼彻斯特城": [179, 190, 199],
    "曼彻斯特联": [125, 54, 4],
    "曼海姆": [203, 150, 170],
    "曼联": [125, 54, 4],
    "朗斯": [205, 171, 142],
    "本菲卡": [203, 195, 179],
    "杜塞尔多夫": [241, 147, 150],
    "柏林联合": [86, 65, 46],
    "柏林赫塔": [139, 159, 177],
    "格勒诺布尔": [179, 206, 226],
    "格拉纳达": [90, 57, 61],
    "桑德豪森": [113, 113, 113],
    "桑托斯": [60, 66, 56],
    "桑普多利亚": [104, 111, 121],
    "梅斯": [221, 159, 171],
    "横滨水手": [207, 201, 200],
    "欧赛尔": [50, 88, 131],
    "比利亚雷亚尔": [182, 174, 160],
    "比勒弗尔德": [140, 148, 163],
    "比萨": [77, 85, 93],
    "毕尔巴鄂竞技": [212, 194, 193],
    "水原三星": [225, 220, 225],
    "水晶宫": [157, 166, 180],
    "汉堡": [45, 72, 113],
    "汉诺威96": [109, 124, 113],
    "沃尔夫斯堡": [160, 222, 165],
    "沃特福德": [209, 151, 111],
    "沙尔克04": [163, 189, 216],
    "河床": [210, 195, 195],
    "法兰克福": [248, 154, 162],
    "波代诺内": [25, 48, 34],
    "波城": [94, 105, 98],
    "波尔图": [175, 192, 198],
    "波尔多": [162, 161, 174],
    "波鸿": [166, 189, 213],
    "泰尔纳纳": [81, 62, 34],
    "泽尼特": [221, 239, 248],
    "洛杉矶银河": [126, 131, 119],
    "洛里昂": [190, 172, 162],
    "流浪者": [167, 186, 210],
    "浙江绿城": [194, 214, 197],
    "海登海姆": [177, 140, 158],
    "热那亚": [111, 83, 59],
    "特内里费": [188, 179, 175],
    "特拉布宗体育": [194, 191, 200],
    "特鲁瓦": [121, 134, 148],
    "狼队": [128, 113, 76],
    "瓦伦西亚": [74, 50, 23],
    "瓦朗谢讷": [225, 144, 146],
    "甘冈": [120, 77, 79],
    "皇家奥维耶多": [84, 75, 43],
    "皇家社会": [197, 184, 177],
    "皇家贝蒂斯": [222, 224, 204],
    "皇家马德里": [216, 204, 182],
    "神户胜利船": [195, 192, 193],
    "科林蒂安": [168, 144, 143],
    "科森扎": [98, 86, 86],
    "科莫": [167, 167, 178],
    "科隆": [179, 155, 155],
    "第戎": [155, 63, 79],
    "米兰德斯": [199, 192, 193],
    "米德尔斯堡": [221, 176, 176],
    "索肖": [68, 78, 80],
    "纽伦堡": [203, 119, 127],
    "纽卡斯尔联": [159, 172, 169],
    "纽维尔老男孩": [99, 54, 55],
    "维琴察": [212, 180, 185],
    "罗德兹": [128, 39, 20],
    "罗斯托克": [217, 207, 213],
    "罗马": [82, 46, 20],
    "美因茨": [178, 84, 89],
    "考文垂": [137, 130, 124],
    "荷尔斯泰因基尔": [83, 111, 144],
    "莫斯科中央陆军": [216, 190, 172],
    "莫斯科火车头": [213, 199, 194],
    "莱万特": [158, 147, 145],
    "莱切": [149, 178, 185],
    "莱加内斯": [128, 132, 93],
    "莱斯特城": [182, 193, 209],
    "莱比锡": [59, 51, 54],
    "莱比锡红牛": [59, 51, 54],
    "菲尔特": [88, 158, 111],
    "萨勒尼塔纳": [159, 118, 106],
    "萨尔茨堡红牛": [180, 149, 151],
    "萨拉戈萨": [65, 31, 9],
    "萨索洛": [129, 152, 139],
    "葡萄牙体育": [160, 208, 190],
    "蒙彼利埃": [201, 201, 205],
    "蒙扎": [164, 73, 92],
    "蓬费拉迪纳": [204, 199, 192],
    "蔚山现代": [148, 146, 141],
    "西汉姆联": [103, 73, 75],
    "西班牙人": [228, 189, 183],
    "诺丁汉森林": [118, 74, 78],
    "诺维奇": [91, 147, 60],
    "谢菲尔德联": [190, 127, 129],
    "贝内文托": [195, 141, 109],
    "费内巴切": [181, 170, 156],
    "费耶诺德": [168, 135, 120],
    "赫塔费": [166, 190, 193],
    "赫拉斯维罗纳": [194, 189, 154],
    "赫罗纳": [101, 47, 44],
    "达姆施塔特": [107, 136, 166],
    "那不勒斯": [110, 163, 207],
    "都灵": [208, 170, 155],
    "里尔": [191, 159, 172],
    "里斯本竞技": [160, 208, 190],
    "里昂": [193, 159, 159],
    "门兴格拉德巴赫": [108, 108, 108],
    "阿尔梅里亚": [214, 197, 182],
    "阿尔科孔": [66, 73, 44],
    "阿拉维斯": [163, 183, 212],
    "阿斯科利": [83, 57, 50],
    "阿斯顿维拉": [132, 125, 107],
    "阿森纳": [170, 101, 95],
    "阿贾克斯": [227, 221, 221],
    "阿雅克肖": [147, 126, 127],
    "雷丁": [199, 168, 174],
    "雷吉纳": [111, 66, 54],
    "雷恩": [187, 143, 129],
    "雷根斯堡": [243, 158, 161],
    "霍芬海姆": [157, 175, 200],
    "韦斯卡": [76, 68, 80],
    "顿涅茨克矿工": [210, 197, 189],
    "马德里竞技": [86, 70, 82],
    "马拉加": [93, 96, 77],
    "马格德堡": [159, 199, 227],
    "马略卡": [216, 179, 139],
    "马赛": [171, 220, 238],
    "鹿岛鹿角": [167, 134, 142]
}


const rgb2Hex = (rgb: Array<number>) => {
    let r = rgb[0]
    let g = rgb[1]
    let b = rgb[2]
    var hex = "#" + ((1 << 24) + (r << 16) + (g << 8) + b).toString(16).slice(1);
    return hex;
}

function getLightColor(oldRgb: Array<number>, level: number) {
    let rgb = [...oldRgb]
    for (var i = 0; i < 3; i++) rgb[i] = Math.floor((255 - rgb[i]) * level + rgb[i]);
    return [rgb[0], rgb[1], rgb[2]];
}

function getDarkColor(oldRgb: Array<number>, level: number) {
    let rgb = [...oldRgb]
    for (var i = 0; i < 3; i++) rgb[i] = Math.floor(rgb[i] * (1 - level));
    return [rgb[0], rgb[1], rgb[2]];
}

export const getClubColor = (club: string, level: number = 0) => {
    if (clubsColor[club]) {
        if (level == 0) {
            return rgb2Hex(clubsColor[club])
        } else if (level > 0) {
            return rgb2Hex(getDarkColor(clubsColor[club], level))
        } else if (level < 0) {
            return rgb2Hex(getLightColor(clubsColor[club], -level))
        }
    } else {
        return 'primary'
    }
}


export const clubBg = (club: string, level: number = 0) => {
    return {
        'background-color': getClubColor(club, level)
    }
}

export const clubTx = (club: string, level: number = 0) => {
    return {
        'color': getClubColor(club, level)
    }
}

export const clubBd = (club: string, level: number = 0) => {
    return {
        'border-color': getClubColor(club, level)
    }
}
